[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
3750
648
3370
900
4464
3659
2465
4939
6122
6065
669
5560
4811
7399
2400
5598
4648
5602
299
6250
7539
2119
1324
2109
4411
5948
3809
3800
6220
307
1699
6644
4893
4646
1375
1985
4704
4659
340
4559
3915
1903
2799
1255
5491
2662
1635
803
5445
5410
281
1460
5036
5998
3961
1519
7010
3694
913
4516
2376
3560
3223
192
619
4128
3700
5977
3893
2614
4149
6017
2210
5780
531
6832
4490
5393
1066
4301
7543
5915
3099
23
5330
1018
4576
6104
1702
4853
1866
2252
6831
25
6357
3263
486
5176
7194
6093
1667
2490
6407
5430
3374
6045
5858
4269
7495
1465
3686
1567
3618
4525
5677
2106
5296
1394
4167
3166
3605
4124
2595
3272
5510
1906
5589
2515
7377
6637
1070
1245
3568
2154
4190
2923
1099
5028
1722
4958
2986
151
1141
7055
1031
5620
5659
5057
6038
7239
4396
513
7467
78
2073
1080
7058
1871
418
1363
7509
5537
7186
742
3772
4151
4562
3870
1913
4822
2265
1767
3004
3586
5566
2212
2539
1277
5949
5612
2380
6040
4480
3300
4230
1679
2115
1854
5736
4933
7261
5787
3068
910
6887
5778
2770
5096
3220
1736
7328
6983
6501
6714
2456
1859
6810
2859
2289
5006
2828
6453
3038
2555
2541
2967
94
465
5310
6929
5226
7123
62
4139
5547
4109
4902
5702
761
1877
885
343
2107
1401
5681
3641
3661
4936
5619
2364
2489
7528
606
4409
7309
7044
408
3743
6630
790
2313
1623
5122
5718
2975
6248
6508
6861
4392
2099
6242
512
6333
4231
1815
5526
2304
2446
623
3317
5689
6101
4350
6656
1362
4333
2112
4498
4063
7492
1920
7346
3747
6352
3477
872
5328
2597
5470
4148
5037
3530
922
6301
2282
730
4671
2717
544
4630
1407
2729
3397
4655
7449
2974
2810
2087
2708
886
2786
7255
6980
5520
6722
3464
4592
4089
4326
3859
5264
6759
5011
6293
3578
6835
499
5292
4969
4321
6609
3780
19
1258
3242
2205
7408
1036
2461
7444
2693
4626
4412
5538
4531
290
478
150
4233
3971
810
7363
4721
6518
1641
3231
3654
3056
7159
6909
3433
2522
3706
5864
5999
1511
5889
5282
2891
2315
2431
4499
1731
4173
6391
3864
3937
4741
3335
2211
3000
656
6469
3634
1934
6740
1344
6641
1734
4216
5051
450
4355
433
1706
670
1271
3193
3342
6405
2466
3106
6012
2197
2848
1816
6734
893
7305
2722
1842
1241
955
4068
7039
535
1215
1633
6666
1348
1726
3196
3765
3695
2685
6362
4291
133
7047
4981
541
902
7077
7354
5938
2060
3329
4417
2058
5505
5041
6319
6886
7006
1457
419
5519
6206
3203
5165
4653
2192
1779
1264
7370
7349
6143
1695
4046
920
6223
5338
2471
6920
4486
1279
2549
3770
4650
5492
2538
868
4117
3040
5860
1952
3440
5530
1582
507
5971
4568
4293
4967
4744
88
7403
2612
3792
3154
2218
127
2827
4211
1778
2463
4223
1610
7465
5284
5450
6284
1283
5744
6286
116
7160
671
7311
6485
2448
1613
3012
4378
4510
6552
264
7134
3213
4866
4181
4114
3504
4998
5698
6050
1688
2495
57
6833
7127
1160
5926
2993
134
3461
1405
350
6966
7420
3945
5693
3976
4462
3764
2919
5389
3956
6521
3117
2121
6689
1605
1292
7033
6227
4287
5640
4603
3648
4543
1043
4315
4780
1158
2505
3608
7256
6822
7212
383
965
64
2435
4407
6625
296
5482
6651
3585
2410
5397
1844
4430
903
3692
414
248
6569
2029
56
137
1970
6811
1323
751
6350
2283
5562
4042
5803
4369
5909
5955
584
1081
5295
2042
5788
4819
1315
3607
5235
2506
1647
6178
2151
641
5169
889
5906
6678
5810
4751
3912
330
6235
1308
565
7078
2621
6981
442
5081
1879
6182
591
2984
6854
4285
6713
7147
6846
4760
5139
3227
3901
5271
4125
6535
1684
7029
7091
7373
2021
4145
1227
2255
1580
495
7436
6252
2147
2738
1214
6567
5610
3366
293
4848
3988
6015
3665
3469
3868
663
314
5816
3824
2791
4237
7486
3775
220
7327
2899
4469
7366
826
4599
5370
1571
1750
6043
3819
1715
3017
672
6702
6289
3436
5076
5385
3097
6662
3762
53
7157
827
5221
265
5920
5881
404
2402
4583
6760
974
4105
6115
2444
1660
4595
6770
5555
5688
4166
1327
847
3134
5984
6985
1103
5957
1999
1351
6193
2483
6283
5056
936
3481
4202
6663
2970
1335
5814
2334
2716
2674
1302
2936
2348
5573
4542
4612
517
1951
3456
4180
304
1819
2028
6551
2378
2004
3630
5063
6111
6390
4261
2688
6919
6027
4205
5617
6160
6602
462
532
6725
3255
5988
4690
4923
2318
6751
2968
420
1889
5381
4298
1730
101
2766
6631
4163
2990
1395
5497
4951
5731
2567
736
3646
980
5854
5192
7038
3310
6163
2683
930
6588
5498
5521
5168
4544
3385
3373
812
2851
3500
197
3290
1833
3088
3720
7037
7371
4214
3783
6798
5660
6992
2316
4053
470
3938
2230
5005
3030
4768
5594
1132
1388
5724
1814
7326
6972
2769
6046
7008
2226
138
1670
1500
3289
1170
6325
245
6902
1168
6176
5741
3442
2776
1919
211
2695
6165
1640
7117
5839
1735
2935
3396
5997
5708
3226
948
3247
6583
5179
7013
3966
6633
686
6986
4372
219
3455
873
1697
2275
5190
1361
6654
2972
3090
5288
3129
1459
6973
6729
4786
5087
144
2411
1232
2918
3495
6560
2838
1991
543
7548
519
7458
7206
764
3501
2835
216
1250
5333
6088
2131
7507
5239
3613
3155
316
4377
1146
5604
5776
3257
1590
6674
5099
6615
1724
6037
657
5986
2502
3137
4677
2434
7144
2570
7545
3015
2847
1805
7257
600
2196
1592
2699
1793
652
5799
6482
3018
879
2477
6930
5160
3731
986
7344
5254
4909
794
4858
4970
4381
3312
2067
5931
796
5413
6890
7447
734
5480
6295
7019
5928
895
1402
6507
3253
3219
1829
5297
3740
1295
6862
38
6977
6898
4643
2396
4986
1247
4144
760
1846
6888
43
7292
7219
2331
7421
2999
3007
5436
5229
677
3159
6543
5488
182
3112
443
6003
4080
26
1152
1914
7032
4802
5105
5822
7042
6549
3778
2528
4351
5017
4354
3782
632
7154
29
3207
1743
7125
4478
5242
4249
6393
36
6968
6314
4454
2673
3725
932
550
2602
5801
366
6149
3978
7400
3742
7378
5606
1314
1865
957
3598
4691
1542
2354
4558
415
5422
2248
4399
1569
6515
5777
69
7023
4801
5882
180
7510
4118
5472
4683
2274
3484
2397
4941
1205
4976
4302
4040
4587
2768
3051
5821
3104
3580
1777
2399
5728
6908
5298
1370
6899
1960
4832
1698
4547
2007
5178
2910
2328
3811
6444
4036
5631
1211
4380
7045
2491
5542
1746
4003
7180
347
459
5623
3523
3084
869
1631
361
5484
2646
6875
3198
979
3270
3873
2429
1693
3103
5117
6447
3703
2785
4203
4220
5936
3813
7546
1294
4988
3080
5243
6658
7025
3309
3615
2745
6327
5468
3148
6063
569
7251
7532
1121
2988
3771
578
4829
4429
3299
6066
4340
3019
6889
1510
3512
1334
6474
2592
851
5383
1775
6749
5775
6682
1116
5899
6940
7299
4836
2480
2136
5205
4679
5870
1076
566
3508
1629
2120
3844
832
3283
1883
2610
4130
5883
1174
5369
5109
3482
3784
112
580
6649
2519
2080
5380
894
3120
3067
5770
3644
1956
5095
4082
2702
6134
445
6570
5716
1176
6542
2023
2655
3531
5791
1379
4450
5600
7329
2730
6596
1274
1941
456
4745
45
6346
2648
6959
4482
4280
853
6704
6683
7395
1924
6298
7110
2190
5847
3606
4693
4305
1953
2626
6922
6768
5367
4842
2512
3577
1148
1839
2124
5683
3377
4458
4157
5649
1915
5525
6788
3172
5658
368
1616
252
4779
4491
2024
2499
5251
1100
5153
318
3168
2931
4987
83
5918
7541
4851
3691
426
6047
4122
2727
2976
3430
7088
457
1299
3681
5194
3850
4225
431
1252
2181
3506
1268
1386
2842
1110
729
5064
6431
5964
5438
4514
3190
1595
6324
6004
1744
7051
5603
1603
3039
3181
1154
3466
1219
2521
6007
3186
332
2525
4993
2642
84
6262
3848
1065
5552
4974
5678
2350
5466
5695
177
1891
1304
5047
1352
1853
2406
3724
2771
3189
6962
5459
141
4002
5166
7544
4732
5406
2415
2047
6758
7164
3563
768
6574
3860
2741
3215
2407
3354
2046
3238
4123
7295
2367
2035
382
5495
4353
5711
2576
5335
2873
4403
6490
1827
5486
2656
5591
4270
4758
7059
6375
5202
4448
6427
6613
2145
5085
4757
1858
4699
7196
3533
4065
3055
6587
4245
5935
1588
2221
341
349
3943
4006
1780
5613
3627
1078
4324
7452
5647
2603
1191
1270
6236
3705
7250
2638
6812
5052
2055
5247
1006
13
1916
7475
6079
7121
2423
3343
1195
337
5574
4590
1090
3152
5089
4005
7197
4628
3400
2998
660
3949
1425
6905
781
1946
3053
5200
2772
463
5347
1620
3650
3418
5850
2068
6167
4034
4553
6799
571
7419
1737
5395
3285
1936
2795
2524
6229
6500
4778
6144
4218
3021
5184
3266
5391
5121
1107
5217
732
2713
5739
6467
6748
5709
7393
1564
2749
3987
6471
5477
3095
5050
5315
2422
2556
1008
2620
5494
6369
5088
3130
3576
3073
7513
5624
1657
7046
3267
6695
5322
5970
384
2076
5502
3020
6014
6575
2130
1972
1792
1917
5000
1840
5872
7254
194
2663
1061
6639
6557
1504
5691
2012
2330
1478
1818
5281
4921
4505
4937
811
2127
7410
6133
6265
1341
1127
7445
993
2164
3420
1164
3483
5648
733
6750
5396
7129
4356
6221
6078
4742
158
1964
6445
5215
778
2022
6318
4017
6855
3905
7498
1126
4736
292
4234
3243
253
6897
6664
4712
2290
3651
7131
6238
7310
2908
4436
4022
610
3795
5960
6510
5715
5399
2017
2438
5420
5868
5753
3689
5474
5511
3479
2030
1787
4784
1206
5278
1398
2632
100
4329
5929
3328
5234
560
6296
6800
3529
6818
1514
3233
4183
2273
5894
1022
4278
3362
2327
8
3111
3544
6356
2351
2983
355
1899
4814
3727
3351
3610
634
1678
4719
5026
1907
1757
5514
3107
6610
4636
5933
244
6057
6504
848
1599
4276
951
2818
5206
1325
2508
6254
1966
1618
2897
3955
1783
14
2011
978
3994
3246
6396
7512
1267
3121
2019
5034
6881
6424
2307
2563
5746
6914
378
7152
17
4975
7224
7062
843
1010
489
2879
2734
167
6303
5804
6151
1166
1184
234
2223
5869
7192
4500
3407
3886
3998
3626
7069
4289
5572
3173
2484
1129
5287
4614
7150
3923
5344
6355
208
788
945
4439
770
3934
7387
394
4431
6600
1638
1905
6272
983
6591
2234
943
3793
7096
6108
4584
1235
3977
2401
5293
6139
6337
6307
498
5493
5134
1509
7493
6487
2581
1604
157
405
4641
659
2530
3070
4906
5535
4335
2474
3324
4876
3319
1516
5663
1721
592
4707
107
3451
5133
3144
782
3982
4077
1950
4743
1471
5705
4781
4152
5317
2229
7012
4995
5379
6404
6730
2566
6511
6949
4700
6058
7122
317
3910
1424
6538
4597
5517
6386
18
3444
4720
4402
763
2669
1453
4232
2374
3986
5861
2867
628
4748
4030
1452
2514
4578
339
5233
4176
1045
2421
1399
6059
1307
3127
6947
3562
5917
2863
7000
6852
2437
3044
758
1373
2473
6916
7188
7469
3990
2453
6681
7223
5475
908
7330
750
2070
2526
1343
3515
4927
1390
2739
693
5625
176
1266
2594
7183
5311
6825
1111
4262
6640
7332
3871
7490
6054
7422
4310
2586
5811
5277
1888
757
2369
3320
2682
5714
4782
7459
1587
5956
5884
6815
7175
4021
6308
7241
6857
679
6127
2337
611
5208
4894
7335
2178
7213
4366
6441
998
938
4323
2185
5922
3062
2370
2667
4052
4777
6234
2504
1987
2156
5886
5533
7423
3897
6817
4835
3150
6083
6874
2329
2231
2428
1931
5950
2091
159
1350
816
4983
4169
1042
5501
3046
5107
4413
2721
7527
6192
4536
1538
5902
6894
4274
5651
676
7106
3617
3093
312
6680
536
3079
300
1749
6158
212
711
3766
2005
327
7028
3662
6582
6976
1397
5536
7001
2756
1196
697
5213
449
2582
1671
7451
850
4949
2709
5621
557
7448
7520
338
3718
956
5368
3716
6762
6635
830
4070
7265
3414
1502
6175
1243
7148
6522
7391
646
564
3781
7086
5144
6414
3744
6868
515
4968
6491
3745
6311
5177
6479
2862
5214
2356
6802
3206
1885
6529
7341
1690
6084
58
740
2876
247
3209
